Ran Plan for 3 projects:

1. dir: `50-eks-demo` workspace: `default`
1. dir: `52-eks-demo-a` workspace: `default`
1. dir: `53-eks-demo-b` workspace: `default`

### 1. dir: `50-eks-demo` workspace: `default`
<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.workers-v1.aws_autoscaling_group.worker[0] has changed
~ resource "aws_autoscaling_group" "worker" {
      ~ desired_capacity          = 4 -> 3
        id                        = "eks-demo-workers-v1-20220829021700621400000017"
        name                      = "eks-demo-workers-v1-20220829021700621400000017"
        # (23 unchanged attributes hidden)

        # (11 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.graviton-v1.aws_autoscaling_group.worker[0] will be created
+ resource "aws_autoscaling_group" "worker" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + enabled_metrics           = [
          + "GroupDesiredCapacity",
          + "GroupInServiceCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupPendingCapacity",
          + "GroupPendingInstances",
          + "GroupStandbyCapacity",
          + "GroupStandbyInstances",
          + "GroupTerminatingCapacity",
          + "GroupTerminatingInstances",
          + "GroupTotalCapacity",
          + "GroupTotalInstances",
        ]
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + max_size                  = 2
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = "eks-demo-graviton-v1-"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + termination_policies      = [
          + "OldestInstance",
        ]
      + vpc_zone_identifier       = [
          + "subnet-0842c4c3776c09e81",
          + "subnet-0a0f1761b255fc975",
          + "subnet-0e1931cbfaf225aa6",
        ]
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "demo"
        }
      + tag {
          + key                 = "KubernetesCluster"
          + propagate_at_launch = true
          + value               = "eks-demo"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "eks-demo-graviton-v1"
        }
      + tag {
          + key                 = "aws-node-termination-handler/managed"
          + propagate_at_launch = true
          + value               = "true"
        }
      + tag {
          + key                 = "k8s.io/cluster-autoscaler/eks-demo"
          + propagate_at_launch = true
          + value               = "owned"
        }
      + tag {
          + key                 = "k8s.io/cluster-autoscaler/enabled"
          + propagate_at_launch = true
          + value               = "true"
        }
      + tag {
          + key                 = "krmt.io/group"
          + propagate_at_launch = true
          + value               = "graviton"
        }
      + tag {
          + key                 = "krmt.io/instancegroup"
          + propagate_at_launch = true
          + value               = "graviton-v1"
        }
      + tag {
          + key                 = "krmt.io/subgroup"
          + propagate_at_launch = true
          + value               = "graviton-v1"
        }
      + tag {
          + key                 = "kubernetes.io/cluster/eks-demo"
          + propagate_at_launch = true
          + value               = "owned"
        }
    }

  # module.graviton-v1.aws_autoscaling_lifecycle_hook.nth[0] will be created
+ resource "aws_autoscaling_lifecycle_hook" "nth" {
      + autoscaling_group_name = (known after apply)
      + default_result         = "CONTINUE"
      + heartbeat_timeout      = 300
      + id                     = (known after apply)
      + lifecycle_transition   = "autoscaling:EC2_INSTANCE_TERMINATING"
      + name                   = "aws-node-termination-handler"
    }

  # module.graviton-v1.aws_cloudwatch_event_rule.nth_asg[0] will be created
+ resource "aws_cloudwatch_event_rule" "nth_asg" {
      + arn            = (known after apply)
      + description    = "Node termination event rule"
      + event_bus_name = "default"
      + event_pattern  = (known after apply)
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "eks-demo-graviton-v1-asg-termination"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.graviton-v1.aws_cloudwatch_event_rule.nth_scheduled[0] will be created
+ resource "aws_cloudwatch_event_rule" "nth_scheduled" {
      + arn            = (known after apply)
      + description    = "Node termination event rule"
      + event_bus_name = "default"
      + event_pattern  = (known after apply)
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "eks-demo-graviton-v1-scheduled-change"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.graviton-v1.aws_cloudwatch_event_rule.nth_spot[0] will be created
+ resource "aws_cloudwatch_event_rule" "nth_spot" {
      + arn            = (known after apply)
      + description    = "Node termination event rule"
      + event_bus_name = "default"
      + event_pattern  = (known after apply)
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "eks-demo-graviton-v1-spot-termination"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.graviton-v1.aws_cloudwatch_event_rule.nth_state[0] will be created
+ resource "aws_cloudwatch_event_rule" "nth_state" {
      + arn            = (known after apply)
      + description    = "Node termination event rule"
      + event_bus_name = "default"
      + event_pattern  = (known after apply)
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "eks-demo-graviton-v1-state-change"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.graviton-v1.aws_cloudwatch_event_target.nth_asg[0] will be created
+ resource "aws_cloudwatch_event_target" "nth_asg" {
      + arn            = "arn:aws:sqs:ap-northeast-2:082867736673:eks-demo-worker"
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "eks-demo-graviton-v1-asg-termination"
      + target_id      = "eks-demo-graviton-v1-asg-termination"
    }

  # module.graviton-v1.aws_cloudwatch_event_target.nth_scheduled[0] will be created
+ resource "aws_cloudwatch_event_target" "nth_scheduled" {
      + arn            = "arn:aws:sqs:ap-northeast-2:082867736673:eks-demo-worker"
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "eks-demo-graviton-v1-scheduled-change"
      + target_id      = "eks-demo-graviton-v1-scheduled-change"
    }

  # module.graviton-v1.aws_cloudwatch_event_target.nth_spot[0] will be created
+ resource "aws_cloudwatch_event_target" "nth_spot" {
      + arn            = "arn:aws:sqs:ap-northeast-2:082867736673:eks-demo-worker"
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "eks-demo-graviton-v1-spot-termination"
      + target_id      = "eks-demo-graviton-v1-spot-termination"
    }

  # module.graviton-v1.aws_cloudwatch_event_target.nth_state[0] will be created
+ resource "aws_cloudwatch_event_target" "nth_state" {
      + arn            = "arn:aws:sqs:ap-northeast-2:082867736673:eks-demo-worker"
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "eks-demo-graviton-v1-state-change"
      + target_id      = "eks-demo-graviton-v1-state-change"
    }

  # module.graviton-v1.aws_iam_instance_profile.worker will be created
+ resource "aws_iam_instance_profile" "worker" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "eks-demo-graviton-v1"
      + path        = "/"
      + role        = "eks-demo-worker"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.graviton-v1.aws_launch_template.worker_spot[0] will be created
+ resource "aws_launch_template" "worker_spot" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + ebs_optimized   = "true"
      + id              = (known after apply)
      + image_id        = "ami-01215679379561f70"
      + instance_type   = "c6g.large"
      + key_name        = "bruce-seoul"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = "eks-demo-graviton-v1-spot-"
      + tags            = {
          + "Environment"                    = "demo"
          + "KubernetesCluster"              = "eks-demo"
          + "Name"                           = "eks-demo-graviton-v1"
          + "krmt.io/group"                  = "graviton"
          + "krmt.io/instancegroup"          = "graviton-v1"
          + "krmt.io/subgroup"               = "graviton-v1"
          + "kubernetes.io/cluster/eks-demo" = "owned"
        }
      + tags_all        = {
          + "Environment"                    = "demo"
          + "KubernetesCluster"              = "eks-demo"
          + "Name"                           = "eks-demo-graviton-v1"
          + "krmt.io/group"                  = "graviton"
          + "krmt.io/instancegroup"          = "graviton-v1"
          + "krmt.io/subgroup"               = "graviton-v1"
          + "kubernetes.io/cluster/eks-demo" = "owned"
        }
      + user_data       = (sensitive)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + delete_on_termination = "true"
              + iops                  = (known after apply)
              + throughput            = (known after apply)
              + volume_size           = 50
              + volume_type           = "gp3"
            }
        }

      + iam_instance_profile {
          + name = "eks-demo-graviton-v1"
        }

      + instance_market_options {
          + market_type = "spot"
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }

      + network_interfaces {
          + associate_public_ip_address = "false"
          + delete_on_termination       = "true"
          + ipv6_address_count          = 0
          + security_groups             = [
              + "sg-020a8a7bdd0104bfc",
              + "sg-093fbd6412584e20f",
            ]
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Environment"                    = "demo"
              + "KubernetesCluster"              = "eks-demo"
              + "Name"                           = "eks-demo-graviton-v1"
              + "krmt.io/group"                  = "graviton"
              + "krmt.io/instancegroup"          = "graviton-v1"
              + "krmt.io/subgroup"               = "graviton-v1"
              + "kubernetes.io/cluster/eks-demo" = "owned"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Environment"                    = "demo"
              + "KubernetesCluster"              = "eks-demo"
              + "Name"                           = "eks-demo-graviton-v1"
              + "krmt.io/group"                  = "graviton"
              + "krmt.io/instancegroup"          = "graviton-v1"
              + "krmt.io/subgroup"               = "graviton-v1"
              + "kubernetes.io/cluster/eks-demo" = "owned"
            }
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.


time="2022-09-06T06:02:12Z" level=info msg="Detected Terraform plan JSON file at /home/atlantis/.atlantis/repos/opspresso/terraform-env-demo/10/default/50-eks-demo/default.json"
time="2022-09-06T06:02:12Z" level=info msg="Starting: Extracting only cost-related params from terraform"
time="2022-09-06T06:02:12Z" level=info msg="Starting: Retrieving cloud prices to calculate costs"
time="2022-09-06T06:02:12Z" level=warning msg="No prices found for module.monitoring-v1.aws_launch_template.worker_spot[0] Instance usage (Linux/UNIX, spot, m6i.large), using 0.00"
time="2022-09-06T06:02:12Z" level=warning msg="No prices found for module.workers-v1.aws_launch_template.worker_spot[0] Instance usage (Linux/UNIX, spot, c6i.large), using 0.00"
time="2022-09-06T06:02:12Z" level=warning msg="No prices found for module.graviton-v1.aws_launch_template.worker_spot[0] Instance usage (Linux/UNIX, spot, c6g.large), using 0.00"
time="2022-09-06T06:02:12Z" level=warning msg="No prices found for module.workers-v1.aws_launch_template.worker_spot[0] Instance usage (Linux/UNIX, spot, c6i.large), using 0.00"
time="2022-09-06T06:02:12Z" level=warning msg="No prices found for module.monitoring-v1.aws_launch_template.worker_spot[0] Instance usage (Linux/UNIX, spot, m6i.large), using 0.00"
time="2022-09-06T06:02:13Z" level=info msg="Output saved to /tmp/opspresso-terraform-env-demo-10/infracost-output.json"

Comment posted to GitHub

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d 50-eks-demo`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.demo.nalbam.com/lock?id=opspresso%252Fterraform-env-demo%252F50-eks-demo%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d 50-eks-demo`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 12 to add, 0 to change, 0 to destroy.

---
### 2. dir: `52-eks-demo-a` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.terraform_remote_state.alb: Reading...
data.terraform_remote_state.vpc: Reading...
data.terraform_remote_state.vpc: Read complete after 1s
data.terraform_remote_state.alb: Read complete after 1s
module.eks.data.aws_region.current: Reading...
module.monitoring-v1.data.aws_ssm_parameter.docker_config: Reading...
module.eks.data.aws_caller_identity.current: Reading...
data.aws_subnets.c: Reading...
module.monitoring-v1.data.aws_caller_identity.current: Reading...
module.eks.data.aws_iam_group.master[0]: Reading...
module.workers-v1.data.aws_caller_identity.current: Reading...
data.aws_subnets.b: Reading...
module.eks.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
module.irsa["external-secrets"].data.aws_caller_identity.current: Reading...
module.workers-v1.data.aws_ssm_parameter.docker_config: Reading...
data.aws_subnets.a: Reading...
module.workers-v1.data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.irsa["aws-load-balancer-controller"].data.aws_caller_identity.current: Reading...
module.irsa["external-secrets"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
data.aws_caller_identity.current: Reading...
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
data.aws_subnets.a: Read complete after 0s [id=ap-northeast-2]
module.monitoring-v1.data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
data.aws_subnets.c: Read complete after 0s [id=ap-northeast-2]
module.irsa["irsa-operator"].data.aws_caller_identity.current: Reading...
module.irsa["aws-node-termination-handler"].data.aws_caller_identity.current: Reading...
module.irsa["karpenter"].data.aws_caller_identity.current: Reading...
data.aws_subnets.b: Read complete after 0s [id=ap-northeast-2]
module.workers-v1.data.aws_ssm_parameter.docker_config: Read complete after 0s [id=/k8s/common/docker-config]
module.irsa["aws-load-balancer-controller"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.monitoring-v1.data.aws_ssm_parameter.docker_config: Read complete after 0s [id=/k8s/common/docker-config]
module.irsa["aws-node"].data.aws_caller_identity.current: Reading...
module.irsa["aws-ebs-csi-driver"].data.aws_caller_identity.current: Reading...
module.irsa["external-dns"].data.aws_caller_identity.current: Reading...
module.irsa["irsa-operator"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.irsa["cluster-autoscaler"].data.aws_caller_identity.current: Reading...
module.irsa["aws-efs-csi-driver"].data.aws_caller_identity.current: Reading...
module.irsa["aws-node-termination-handler"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.irsa["aws-node"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.irsa["karpenter"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.irsa["external-dns"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.irsa["aws-efs-csi-driver"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.irsa["cluster-autoscaler"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.irsa["aws-ebs-csi-driver"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.eks.data.aws_iam_group.master[0]: Read complete after 0s [id=AGPARGS2NKBQ5AE36UBZS]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.eks.data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster" {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # module.eks.aws_cloudwatch_log_group.cluster will be created
+ resource "aws_cloudwatch_log_group" "cluster" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = (known after apply)
      + name_prefix       = "/aws/eks/eks-demo-a-"
      + retention_in_days = 7
      + tags              = {
          + "Environment"                      = "demo"
          + "KubernetesCluster"                = "eks-demo-a"
          + "Name"                             = "eks-demo-a"
          + "kubernetes.io/cluster/eks-demo-a" = "owned"
        }
      + tags_all          = {
          + "Environment"                      = "demo"
          + "KubernetesCluster"                = "eks-demo-a"
          + "Name"                             = "eks-demo-a"
          + "kubernetes.io/cluster/eks-demo-a" = "owned"
        }
    }

  # module.eks.aws_eks_addon.coredns[0] will be created
+ resource "aws_eks_addon" "coredns" {
      + addon_name        = "coredns"
      + addon_version     = "v1.8.7-eksbuild.1"
      + arn               = (known after apply)
      + cluster_name      = "eks-demo-a"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + modified_at       = (known after apply)
      + resolve_conflicts = "OVERWRITE"
      + tags_all          = (known after apply)
    }

  # module.eks.aws_eks_addon.kube-proxy[0] will be created
+ resource "aws_eks_addon" "kube-proxy" {
      + addon_name        = "kube-proxy"
      + addon_version     = "v1.22.6-eksbuild.1"
      + arn               = (known after apply)
      + cluster_name      = "eks-demo-a"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + modified_at       = (known after apply)
      + resolve_conflicts = "OVERWRITE"
      + tags_all          = (known after apply)
    }

  # module.eks.aws_eks_addon.vpc-cni[0] will be created
+ resource "aws_eks_addon" "vpc-cni" {
      + addon_name        = "vpc-cni"
      + addon_version     = "v1.10.3-eksbuild.1"
      + arn               = (known after apply)
      + cluster_name      = "eks-demo-a"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + modified_at       = (known after apply)
      + resolve_conflicts = "OVERWRITE"
      + tags_all          = (known after apply)
    }

  # module.eks.aws_eks_cluster.cluster will be created
+ resource "aws_eks_cluster" "cluster" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "eks-demo-a"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags                  = {
          + "Environment" = "demo"
          + "Name"        = "eks-demo-a"
        }
      + tags_all              = {
          + "Environment" = "demo"
          + "Name"        = "eks-demo-a"
        }
      + version               = "1.23"

      + kubernetes_network_config {
          + ip_family         = "ipv4"
          + service_ipv4_cidr = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-0842c4c3776c09e81",
              + "subnet-0a0f1761b255fc975",
              + "subnet-0e1931cbfaf225aa6",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_instance_profile.worker will be created
+ resource "aws_iam_instance_profile" "worker" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "eks-demo-a-worker"
      + path        = "/"
      + role        = "eks-demo-a-worker"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.eks.aws_iam_openid_connect_provider.cluster will be created
+ resource "aws_iam_openid_connect_provider" "cluster" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = [
          + "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ]
      + url             = (known after apply)
    }

  # module.eks.aws_iam_role.cluster will be created
+ resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-demo-a-cluster"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role.worker will be created
+ resource "aws_iam_role" "worker" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-demo-a-worker"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy will be created
+ resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eks-demo-a-cluster"
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy will be created
+ resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSServicePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      + role       = "eks-demo-a-cluster"
    }

  # module.eks.aws_iam_role_policy_attachment.worker_AmazonEC2ContainerRegistryReadOnly will be created
+ resource "aws_iam_role_policy_attachment" "worker_AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "eks-demo-a-worker"
    }

  # module.eks.aws_iam_role_policy_attachment.worker_AmazonEKSWorkerNodePolicy will be created
+ resource "aws_iam_role_policy_attachment" "worker_AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "eks-demo-a-worker"
    }

  # module.eks.aws_iam_role_policy_attachment.worker_AmazonEKS_CNI_Policy will be created
+ resource "aws_iam_role_policy_attachment" "worker_AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "eks-demo-a-worker"
    }

  # module.eks.aws_security_group.cluster will be created
+ resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "Cluster communication with Worker Nodes"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "eks-demo-a-cluster"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                             = "eks-demo-a-cluster"
          + "kubernetes.io/cluster/eks-demo-a" = "owned"
        }
      + tags_all               = {
          + "Name"                             = "eks-demo-a-cluster"
          + "kubernetes.io/cluster/eks-demo-a" = "owned"
        }
      + vpc_id                 = "vpc-0a42049ec518342a3"
    }

  # module.eks.aws_security_group.worker will be created
+ resource "aws_security_group" "worker" {
      + arn                    = (known after apply)
      + description            = "EKS worker node common security_group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "eks-demo-a-worker"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                             = "eks-demo-a-worker"
          + "kubernetes.io/cluster/eks-demo-a" = "owned"
        }
      + tags_all               = {
          + "Name"                             = "eks-demo-a-worker"
          + "kubernetes.io/cluster/eks-demo-a" = "owned"
        }
      + vpc_id                 = "vpc-0a42049ec518342a3"
    }

  # module.eks.aws_security_group_rule.cluster_vpn will be created
+ resource "aws_security_group_rule" "cluster_vpn" {
      + cidr_blocks              = [
          + "10.0.0.0/8",
        ]
      + description              = "Allow vpn to communicate with the cluster API Server"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.cluster_worker will be created
+ resource "aws_security_group_rule" "cluster_worker" {
      + description              = "Allow workers to communicate with the cluster API Server"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.worker_cluster will be created
+ resource "aws_security_group_rule" "worker_cluster" {
      + description              = "Allow to communicate between master and workers (eks-demo-a-worker)"
      + from_port                = 1025
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.worker_cluster_10250 will be created
+ resource "aws_security_group_rule" "worker_cluster_10250" {
      + description              = "Allow to communicate between master and workers (eks-demo-a-worker)"
      + from_port                = 10250
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.worker_cluster_443 will be created
+ resource "aws_security_group_rule" "worker_cluster_443" {
      + description              = "Allow to communicate between master and workers (eks-demo-a-worker)"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.worker_source[0] will be created
+ resource "aws_security_group_rule" "worker_source" {
      + description              = "Allow to communicate between source and workers (eks-demo-a-worker)"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-09cfa5f5483a6dfa8"
      + to_port                  = 0
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.worker_ssh will be created
+ resource "aws_security_group_rule" "worker_ssh" {
      + cidr_blocks              = [
          + "10.0.0.0/8",
        ]
      + description              = "Allow to communicate between ssh and workers (eks-demo-a-worker)"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.worker_worker will be created
+ resource "aws_security_group_rule" "worker_worker" {
      + description              = "Allow to communicate between workers (eks-demo-a-worker)"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

  # module.eks.aws_sqs_queue.worker will be created
+ resource "aws_sqs_queue" "worker" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 300
      + name                              = "eks-demo-a-worker"
      + name_prefix                       = (known after apply)
      + policy                            = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sqs:SendMessage"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "events.amazonaws.com",
                              + "sqs.amazonaws.com",
                            ]
                        }
                      + Resource  = "arn:aws:sqs:ap-northeast-2:082867736673:eks-demo-a-worker"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + receive_wait_time_seconds         = 0
      + tags                              = {
          + "Name"                             = "eks-demo-a-worker"
          + "kubernetes.io/cluster/eks-demo-a" = "owned"
        }
      + tags_all                          = {
          + "Name"                             = "eks-demo-a-worker"
          + "kubernetes.io/cluster/eks-demo-a" = "owned"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.eks.kubernetes_config_map.aws_auth will be created
+ resource "kubernetes_config_map" "aws_auth" {
      + data = {
          + "mapRoles" = <<-EOT
                - "groups":
                  - "system:bootstrappers"
                  - "system:nodes"
                  "rolearn": "arn:aws:iam::082867736673:role/eks-demo-a-worker"
                  "username": "system:node:{{EC2PrivateDNSName}}"
                - "groups":
                  - "system:masters"
                  "rolearn": "arn:aws:iam::082867736673:role/atlantis-ecs_task_execution"
                  "username": "atlantis"
                - "groups":
                  - "system:masters"
                  "rolearn": "arn:aws:iam::082867736673:role/k8s-master"
                  "username": "k8s-master"
                - "groups": []
                  "rolearn": "arn:aws:iam::082867736673:role/k8s-readonly"
                  "username": "k8s-readonly"
            EOT
          + "mapUsers" = <<-EOT
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::082867736673:user/ops"
                  "username": "iam-user-ops"
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::082867736673:user/bruce"
                  "username": "iam-user-bruce"
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::082867736673:user/jungyoul.yu"
                  "username": "iam-user-jungyoul.yu"
            EOT
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.irsa["aws-ebs-csi-driver"].data.aws_iam_policy_document.irsa will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "irsa" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:addon-aws-ebs-csi-driver:ebs-csi-controller-sa",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.irsa["aws-ebs-csi-driver"].aws_iam_policy.irsa will be created
+ resource "aws_iam_policy" "irsa" {
      + arn         = (known after apply)
      + description = "irsa--eks-demo-a--aws-ebs-csi-driver policy"
      + id          = (known after apply)
      + name        = "irsa--eks-demo-a--aws-ebs-csi-driver"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:AttachVolume",
                          + "ec2:CreateSnapshot",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeSnapshots",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeVolumes",
                          + "ec2:DescribeVolumesModifications",
                          + "ec2:DetachVolume",
                          + "ec2:ModifyVolume",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "ec2:CreateAction" = [
                                  + "CreateVolume",
                                  + "CreateSnapshot",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:ec2:*:*:volume/*",
                          + "arn:aws:ec2:*:*:snapshot/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "ec2:DeleteTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ec2:*:*:volume/*",
                          + "arn:aws:ec2:*:*:snapshot/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "aws:RequestTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "aws:RequestTag/CSIVolumeName" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/CSIVolumeName" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteSnapshot",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/CSIVolumeSnapshotName" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteSnapshot",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.irsa["aws-ebs-csi-driver"].aws_iam_role.irsa will be created
+ resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "irsa--eks-demo-a--aws-ebs-csi-driver"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "irsa--eks-demo-a--aws-ebs-csi-driver"
        }
      + tags_all              = {
          + "Name" = "irsa--eks-demo-a--aws-ebs-csi-driver"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.irsa["aws-ebs-csi-driver"].aws_iam_role_policy_attachment.irsa will be created
+ resource "aws_iam_role_policy_attachment" "irsa" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "irsa--eks-demo-a--aws-ebs-csi-driver"
    }

  # module.irsa["aws-efs-csi-driver"].data.aws_iam_policy_document.irsa will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "irsa" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:addon-aws-efs-csi-driver:efs-csi-controller-sa",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.irsa["aws-efs-csi-driver"].aws_iam_policy.irsa will be created
+ resource "aws_iam_policy" "irsa" {
      + arn         = (known after apply)
      + description = "irsa--eks-demo-a--aws-efs-csi-driver policy"
      + id          = (known after apply)
      + name        = "irsa--eks-demo-a--aws-efs-csi-driver"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "elasticfilesystem:DescribeAccessPoints",
                          + "elasticfilesystem:DescribeFileSystems",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticfilesystem:CreateAccessPoint",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "aws:RequestTag/efs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = "elasticfilesystem:DeleteAccessPoint"
                      + Condition = {
                          + StringEquals = {
                              + "aws:ResourceTag/efs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.irsa["aws-efs-csi-driver"].aws_iam_role.irsa will be created
+ resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "irsa--eks-demo-a--aws-efs-csi-driver"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "irsa--eks-demo-a--aws-efs-csi-driver"
        }
      + tags_all              = {
          + "Name" = "irsa--eks-demo-a--aws-efs-csi-driver"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.irsa["aws-efs-csi-driver"].aws_iam_role_policy_attachment.irsa will be created
+ resource "aws_iam_role_policy_attachment" "irsa" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "irsa--eks-demo-a--aws-efs-csi-driver"
    }

  # module.irsa["aws-load-balancer-controller"].data.aws_iam_policy_document.irsa will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "irsa" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:addon-aws-load-balancer-controller:aws-load-balancer-controller",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.irsa["aws-load-balancer-controller"].aws_iam_policy.irsa will be created
+ resource "aws_iam_policy" "irsa" {
      + arn         = (known after apply)
      + description = "irsa--eks-demo-a--aws-load-balancer-controller policy"
      + id          = (known after apply)
      + name        = "irsa--eks-demo-a--aws-load-balancer-controller"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "iam:CreateServiceLinkedRole",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeTags",
                          + "ec2:GetCoipPoolUsage",
                          + "ec2:DescribeCoipPools",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeListenerCertificates",
                          + "elasticloadbalancing:DescribeSSLPolicies",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "cognito-idp:DescribeUserPoolClient",
                          + "acm:ListCertificates",
                          + "acm:DescribeCertificate",
                          + "iam:ListServerCertificates",
                          + "iam:GetServerCertificate",
                          + "waf-regional:GetWebACL",
                          + "waf-regional:GetWebACLForResource",
                          + "waf-regional:AssociateWebACL",
                          + "waf-regional:DisassociateWebACL",
                          + "wafv2:GetWebACL",
                          + "wafv2:GetWebACLForResource",
                          + "wafv2:AssociateWebACL",
                          + "wafv2:DisassociateWebACL",
                          + "shield:GetSubscriptionState",
                          + "shield:DescribeProtection",
                          + "shield:CreateProtection",
                          + "shield:DeleteProtection",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateSecurityGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DeleteSecurityGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:CreateListener",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:DeleteRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "elasticloadbalancing:SetSecurityGroups",
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:DeleteTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DeregisterTargets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:SetWebAcl",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:AddListenerCertificates",
                          + "elasticloadbalancing:RemoveListenerCertificates",
                          + "elasticloadbalancing:ModifyRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.irsa["aws-load-balancer-controller"].aws_iam_role.irsa will be created
+ resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "irsa--eks-demo-a--aws-load-balancer-controller"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "irsa--eks-demo-a--aws-load-balancer-controller"
        }
      + tags_all              = {
          + "Name" = "irsa--eks-demo-a--aws-load-balancer-controller"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          +
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.